GetCategories Method
 Gets the categories admitted by this filter.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public ICollection<ElementId> GetCategories()
  Visual Basic
Public Function GetCategories As ICollection(Of ElementId)
  Visual C++
public:
ICollection<ElementId^>^ GetCategories()
 See Also
  ParameterFilterElement Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →